burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_adc.c
/*!
    \file    gd32w51x_f5hc_adc.c
    \brief   ADC driver

    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32w51x_f5hc_adc.h"

/* discontinuous mode macro*/
#define  ADC_CHANNEL_LENGTH_SUBTRACT_ONE            ((uint8_t)0x01U)

/* ADC routine channel macro */
#define  ADC_ROUTINE_CHANNEL_RANK_SIX               ((uint8_t)0x06U)
#if defined(GD32F5HC)
#define  ADC_ROUTINE_CHANNEL_RANK_TWELVE            ((uint8_t)0x0CU)
#else
#define  ADC_ROUTINE_CHANNEL_RANK_NINE              ((uint8_t)0x09U)
#endif /* defined(GD32F5HC) */
#define  ADC_ROUTINE_CHANNEL_RANK_LENGTH            ((uint8_t)0x05U)

/* ADC sampling time macro */
#define  ADC_CHANNEL_SAMPLE_TEN                     ((uint8_t)0x0AU)
#if defined(GD32F5HC)
#define  ADC_CHANNEL_SAMPLE_FIFTEEN                 ((uint8_t)0x0FU)
#else
#define  ADC_CHANNEL_SAMPLE_ELEVEN                  ((uint8_t)0x0BU)
#endif /* defined(GD32F5HC) */
#define  ADC_CHANNEL_SAMPLE_LENGTH                  ((uint8_t)0x03U)

/* ADC inserted channel macro */
#define  ADC_INSERTED_CHANNEL_RANK_LENGTH           ((uint8_t)0x05U)
#define  ADC_INSERTED_CHANNEL_SHIFT_OFFSET          ((uint8_t)0x0FU)

/* ADC inserted channel offset macro */
#define  ADC_OFFSET_LENGTH                          ((uint8_t)0x03U)
#define  ADC_OFFSET_SHIFT_LENGTH                    ((uint8_t)0x04U)

/* ADC sequence external trigger mode offset macro */
#define ROUTINE_TRIGGER_MODE_OFFSET                 ((uint32_t)0x0000001CU)
#define INSERTED_TRIGGER_MODE_OFFSET                ((uint32_t)0x00000014U)

/* ADC routine sequence length */
#if defined(GD32F5HC)
#define ROUTINE_LENGTH_HIGH_VALUE                  ((uint32_t)0x0000000CU)
#define ROUTINE_RANK_HIGH_VALUE                    ((uint32_t)0x0000000CU)
#else
#define ROUTINE_LENGTH_HIGH_VALUE                  ((uint32_t)0x00000009U)
#define ROUTINE_RANK_HIGH_VALUE                    ((uint32_t)0x00000009U)
#endif /* defined(GD32F5HC) */

#define ADC_CHANNEL_INTERNAL_MASK                  ((uint32_t)0x01C00000U)
#define ADC_LATCH_DATA_MASK                        ((uint32_t)0x00000003U)
#define ADC_FLAG_MASK                              ((uint32_t)0x0000007FU)
#define ADC_INT_MASK                               ((uint32_t)0x0C0000E0U)
#define ADC_INT_FLAG_MASK                          ((uint32_t)0x00000067U)

/*!
    \brief      reset ADC (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_deinit(void)
{
    rcu_periph_reset_enable(RCU_ADCRST);
    rcu_periph_reset_disable(RCU_ADCRST);
}

/*!
    \brief      configure the ADC clock (API_ID(0x0002U))
    \param[in]  prescaler: configure ADC prescaler ratio
                only one parameter can be selected which is shown as below:
      \arg        ADC_ADCCK_PCLK2_DIV2: PCLK2 div2
      \arg        ADC_ADCCK_PCLK2_DIV4: PCLK2 div4
      \arg        ADC_ADCCK_PCLK2_DIV6: PCLK2 div6
      \arg        ADC_ADCCK_PCLK2_DIV8: PCLK2 div8
      \arg        ADC_ADCCK_HCLK_DIV5: HCLK div5
      \arg        ADC_ADCCK_HCLK_DIV6: HCLK div6
      \arg        ADC_ADCCK_HCLK_DIV10: HCLK div10
      \arg        ADC_ADCCK_HCLK_DIV20: HCLK div20
    \param[out] none
    \retval     none
*/
void adc_clock_config(uint32_t prescaler)
{
    ADC_CCTL &= ~((uint32_t)ADC_CCTL_ADCCK);
    ADC_CCTL |= (uint32_t) prescaler;
}

/*!
    \brief      enable ADC interface (API_ID(0x0003U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_enable(void)
{
    if(RESET == (ADC_CTL1 & ADC_CTL1_ADCON)){
        /* enable ADC */
        ADC_CTL1 |= (uint32_t)ADC_CTL1_ADCON;
    }
}

/*!
    \brief      disable ADC interface (API_ID(0x0004U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_disable(void)
{
    /* disable ADC */
    ADC_CTL1 &= ~((uint32_t)ADC_CTL1_ADCON);
}


/*!
    \brief      enable DMA request (API_ID(0x0005U))
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence for GD32F5HCxx devices
    \param[out] none
    \retval     none
*/
void adc_dma_mode_enable(uint8_t adc_sequence)
{
    switch(adc_sequence){
    case ADC_ROUTINE_CHANNEL:
        /* enable routine DMA request */
        ADC_CTL1 |= (uint32_t)(ADC_CTL1_RDMA);
    break;
#if defined(GD32F5HC)
    case ADC_INSERTED_CHANNEL:
        /* disable inserted DMA request*/
        ADC_CTL1 |= (uint32_t)(ADC_CTL1_IDMA);
        break;
#endif /* defined(GD32F5HC) */
    default:
        break;
    }
}




/*!
    \brief      disable DMA request (API_ID(0x0006U))
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence for GD32F5HCxx devices
    \param[out] none
    \retval     none
*/
void adc_dma_mode_disable(uint8_t adc_sequence)
{
    switch(adc_sequence){
    case ADC_ROUTINE_CHANNEL:
        /* disable routine DMA request */
        ADC_CTL1 &= ~((uint32_t)ADC_CTL1_RDMA);
    break;
#if defined(GD32F5HC)
    case ADC_INSERTED_CHANNEL:
        /* disable inserted DMA request*/
        ADC_CTL1 &= ~((uint32_t)ADC_CTL1_IDMA);
        break;
#endif /* defined(GD32F5HC) */
    default:
        break;
    }
}



/*!
    \brief      when DMA=1, the DMA engine issues a request at end of each conversion (API_ID(0x0007U))
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence for GD32F5HCxx devices
    \param[out] none
    \retval     none
*/
void adc_dma_request_after_last_enable(uint8_t adc_sequence)
{
    switch(adc_sequence){
    case ADC_ROUTINE_CHANNEL:
        /* issues a request at end of each routine conversion*/
        ADC_CTL1 |= (uint32_t)(ADC_CTL1_RDDM);
    break;
#if defined(GD32F5HC)
    case ADC_INSERTED_CHANNEL:
        /* issues a request at end of each inserted conversion*/
        ADC_CTL1 |= (uint32_t)(ADC_CTL1_IDDM);
        break;
#endif /* defined(GD32F5HC) */
    default:
        break;
    }
}


/*!
    \brief      the DMA engine is disabled after the end of transfer signal from DMA controller is detected (API_ID(0x0008U))
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence for GD32F5HCxx devices
    \param[out] none
    \retval     none
*/
void adc_dma_request_after_last_disable(uint8_t adc_sequence)
{
    switch(adc_sequence){
    case ADC_ROUTINE_CHANNEL:
        /* disable DMA after the end of routine sequence transfer signal*/
        ADC_CTL1 &= ~((uint32_t)ADC_CTL1_RDDM);
    break;
#if defined(GD32F5HC)
    case ADC_INSERTED_CHANNEL:
        /* disable DMA after the end of inserted sequence transfer signal*/
        ADC_CTL1 &= ~((uint32_t)ADC_CTL1_IDDM);
        break;
#endif /* defined(GD32F5HC) */
    default:
        break;
    }
}

/*!
    \brief      configure end of conversion mode (API_ID(0x0009U))
    \param[in]  end_selection: end of conversion mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_EORC_SET_SEQUENCE: only at the end of a sequence of routine conversions, the EORC bit is set. Overflow detection is disabled unless DMA=1.
      \arg        ADC_EORC_SET_CONVERSION: at the end of each routine conversion, the EORC bit is set. Overflow is detected automatically.
    \param[out] none
    \retval     none
*/
void adc_end_of_conversion_config(uint32_t end_selection)
{
    /* only at the end of a sequence of routine conversions, the EORC bit is set */
    ADC_CTL1 &= ~((uint32_t)ADC_CTL1_EORCM);
    /* at the end of each routine conversion, the EORC bit is set. Overflow is detected automatically */
    ADC_CTL1 |= end_selection & ADC_CTL1_EORCM;
}

/*!
    \brief      enable or disable ADC internal channels (API_ID(0x000AU))
    \param[in]  internal_channel: the internal channels
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INTERNAL_VBAT: VBAT channel
      \arg        ADC_CHANNEL_INTERNAL_VREFINT: vrefint channel for GD32F5HCxx devices
      \arg        ADC_CHANNEL_INTERNAL_TEMPSENSOR: vrefint channel for GD32F5HCxx devices
      \arg        ADC_CHANNEL_INTERNAL_TEMP_VREF: vrefint and temperature sensor channel for GD32W515xx devices
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_internal_channel_config(uint32_t internal_channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        ADC_CCTL |= (uint32_t)(internal_channel & ADC_CHANNEL_INTERNAL_MASK);
    } else {
        ADC_CCTL &= ~((uint32_t)(internal_channel & ADC_CHANNEL_INTERNAL_MASK));
    }
}

/*!
    \brief      configure ADC discontinuous mode (API_ID(0x000BU))
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
      \arg        ADC_CHANNEL_DISCON_DISABLE: disable discontinuous mode of routine and inserted channel
    \param[in]  length: number of conversions in discontinuous mode,the number can be 1..8
                        for routine sequence ,the number has no effect for inserted sequence
    \param[out] none
    \retval     none
*/
void adc_discontinuous_mode_config(uint8_t adc_sequence, uint8_t length)
{
    /* disable discontinuous mode of routine & inserted channel */
    ADC_CTL0 &= ~((uint32_t)( ADC_CTL0_DISRC | ADC_CTL0_DISIC ));
    switch(adc_sequence){
    case ADC_ROUTINE_CHANNEL:
        /* configure the number of conversions in discontinuous mode  */
        ADC_CTL0 &= ~((uint32_t)ADC_CTL0_DISNUM);
        if((length <= 8U) && (length >= 1U)){
            ADC_CTL0 |= CTL0_DISNUM(((uint32_t)length - ADC_CHANNEL_LENGTH_SUBTRACT_ONE));
        }
        /* enable routine sequence discontinuous mode */
        ADC_CTL0 |= (uint32_t)ADC_CTL0_DISRC;
        break;
    case ADC_INSERTED_CHANNEL:
        /* enable inserted sequence discontinuous mode */
        ADC_CTL0 |= (uint32_t)ADC_CTL0_DISIC;
        break;
    case ADC_CHANNEL_DISCON_DISABLE:
        /* disable discontinuous mode of routine & inserted sequence */
    default:
        break;
    }
}

/*!
    \brief      configure ADC special function (API_ID(0x000CU))
    \param[in]  function: the function to configure
                one or more parameters can be selected which is shown as below:
      \arg        ADC_SCAN_MODE: scan mode select
      \arg        ADC_INSERTED_CHANNEL_AUTO: inserted sequence convert automatically
      \arg        ADC_CONTINUOUS_MODE: continuous mode select
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_special_function_config(uint32_t function, ControlStatus newvalue)
{
    if(newvalue){
        if(0U != (function & ADC_SCAN_MODE)){
            /* enable scan mode */
            ADC_CTL0 |= ADC_SCAN_MODE;
        }
        if(0U != (function & ADC_INSERTED_CHANNEL_AUTO)){
            /* enable inserted sequence convert automatically */
            ADC_CTL0 |= ADC_INSERTED_CHANNEL_AUTO;
        } 
        if(0U != (function & ADC_CONTINUOUS_MODE)){
            /* enable continuous mode */
            ADC_CTL1 |= ADC_CONTINUOUS_MODE;
        }        
    }else{
        if(0U != (function & ADC_SCAN_MODE)){
            /* disable scan mode */
            ADC_CTL0 &= ~ADC_SCAN_MODE;
        }
        if(0U != (function & ADC_INSERTED_CHANNEL_AUTO)){
            /* disable inserted sequence convert automatically */
            ADC_CTL0 &= ~ADC_INSERTED_CHANNEL_AUTO;
        } 
        if(0U != (function & ADC_CONTINUOUS_MODE)){
            /* disable continuous mode */
            ADC_CTL1 &= ~ADC_CONTINUOUS_MODE;
        }       
    }
}


/*!
    \brief      configure ADC data alignment (API_ID(0x000DU))
    \param[in]  data_alignment: data alignment select
                only one parameter can be selected which is shown as below:
      \arg        ADC_DATAALIGN_RIGHT: right alignment
      \arg        ADC_DATAALIGN_LEFT: left alignment
    \param[out] none
    \retval     none
*/
void adc_data_alignment_config(uint32_t data_alignment)
{
    ADC_CTL1 &= ~((uint32_t)ADC_CTL1_DAL);
    ADC_CTL1 |= data_alignment & ADC_CTL1_DAL;

