burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_adc.c
    ADC_LDCTL = ldctl;
}
#endif /* defined(GD32F5HC) */

/*!
    \brief      enable ADC analog watchdog single channel (API_ID(0x001AU))
    \param[in]  adc_channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_x: ADC Channelx,x=0..14 for GD32F5HCxx devices,x=0..11 for GD32W515xx devices
    \param[out] none
    \retval     none
*/
void adc_watchdog0_single_channel_enable(uint8_t adc_channel)
{
    ADC_CTL0 &= (uint32_t)~(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN | ADC_CTL0_WD0SC | ADC_CTL0_WD0CHSEL);

    ADC_CTL0 |= (uint32_t)adc_channel;
    ADC_CTL0 |= (uint32_t)(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN | ADC_CTL0_WD0SC);
}

/*!
    \brief      configure ADC analog watchdog sequence channel (API_ID(0x001BU))
    \param[in]  adc_sequence: the sequence use analog watchdog
                only one parameter can be selected which is shown as below: 
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
      \arg        ADC_ROUTINE_INSERTED_CHANNEL: both routine and inserted sequence
    \param[out] none
    \retval     none
*/
void adc_watchdog0_sequence_channel_enable(uint8_t adc_sequence)
{
    ADC_CTL0 &= ~((uint32_t)(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN | ADC_CTL0_WD0SC));
    /* select the sequence */
    switch(adc_sequence){
    case ADC_ROUTINE_CHANNEL:
        /* routine channel analog watchdog enable */
        ADC_CTL0 |= (uint32_t) ADC_CTL0_RWD0EN;
        break;
    case ADC_INSERTED_CHANNEL:
        /* inserted channel analog watchdog enable */
        ADC_CTL0 |= (uint32_t) ADC_CTL0_IWD0EN;
        break;
    case ADC_ROUTINE_INSERTED_CHANNEL:
        /* routine and inserted channel analog watchdog enable */
        ADC_CTL0 |= (uint32_t)(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN);
        break;
    default:
        break;
    }
}

/*!
    \brief      disable ADC analog watchdog (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_watchdog0_disable(void)
{
    ADC_CTL0 &= (uint32_t)~(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN | ADC_CTL0_WD0SC | ADC_CTL0_WD0CHSEL);
}

/*!
    \brief      configure ADC analog watchdog threshold (API_ID(0x001DU))
    \param[in]  low_threshold: analog watchdog low threshold,0..2^20-1 for GD32F5HCxx devices,0..2^12-1 for GD32W515xx devices
    \param[in]  high_threshold: analog watchdog high threshold,0..2^20-1 for GD32F5HCxx devices,0..2^12-1 for GD32W515xx devices
    \param[out] none
    \retval     none
*/
void adc_watchdog0_threshold_config(uint32_t low_threshold, uint32_t high_threshold)
{
    /* configure ADC analog watchdog low threshold */
    ADC_WD0LT = (uint32_t)WD0LT_WD0LT(low_threshold);
    /* configure ADC analog watchdog high threshold */
    ADC_WD0HT = (uint32_t)WD0HT_WD0HT(high_threshold);
}

/*!
    \brief      configure ADC oversample mode (API_ID(0x001EU))
    \param[in]  mode: ADC oversampling mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_ALL_CONVERT: all oversampled conversions for a channel are done consecutively after a trigger
      \arg        ADC_OVERSAMPLING_ONE_CONVERT: each oversampled conversion for a channel needs a trigger
    \param[in]  shift: ADC oversampling shift
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_SHIFT_NONE: no oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_1B: 1-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_2B: 2-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_3B: 3-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_4B: 3-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_5B: 5-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_6B: 6-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_7B: 7-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_8B: 8-bit oversampling shift
    \param[in]  ratio: ADC oversampling ratio
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_RATIO_MUL2: oversampling ratio multiple 2
      \arg        ADC_OVERSAMPLING_RATIO_MUL4: oversampling ratio multiple 4
      \arg        ADC_OVERSAMPLING_RATIO_MUL8: oversampling ratio multiple 8
      \arg        ADC_OVERSAMPLING_RATIO_MUL16: oversampling ratio multiple 16
      \arg        ADC_OVERSAMPLING_RATIO_MUL32: oversampling ratio multiple 32
      \arg        ADC_OVERSAMPLING_RATIO_MUL64: oversampling ratio multiple 64
      \arg        ADC_OVERSAMPLING_RATIO_MUL128: oversampling ratio multiple 128
      \arg        ADC_OVERSAMPLING_RATIO_MUL256: oversampling ratio multiple 256
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_config(uint32_t mode, uint16_t shift, uint8_t ratio)
{
    /* configure ADC oversampling mode */
    if(ADC_OVERSAMPLING_ONE_CONVERT == mode){
        ADC_OVSAMPCTL |= (uint32_t)ADC_OVSAMPCTL_TOVS;
    }else{
        ADC_OVSAMPCTL &= ~((uint32_t)ADC_OVSAMPCTL_TOVS);
    }
    /* configure the shift and ratio */
    ADC_OVSAMPCTL &= ~((uint32_t)(ADC_OVSAMPCTL_OVSR | ADC_OVSAMPCTL_OVSS));
    ADC_OVSAMPCTL |= (((uint32_t)shift & ADC_OVSAMPCTL_OVSS) | ((uint32_t)ratio & ADC_OVSAMPCTL_OVSR));
}

/*!
    \brief      enable ADC oversample mode (API_ID(0x001FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_enable(void)
{
    ADC_OVSAMPCTL |= ADC_OVSAMPCTL_OVSEN;
}

/*!
    \brief      disable ADC oversample mode (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_disable(void)
{
    ADC_OVSAMPCTL &= ~((uint32_t)ADC_OVSAMPCTL_OVSEN);
}

/*!
    \brief      get the ADC flag (API_ID(0x0021U))
    \param[in]  flag: the ADC flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_WD0E: analog watchdog 0 event flag
      \arg        ADC_FLAG_EOC: end of sequence conversion flag(only for GD32W515xx devices)
      \arg        ADC_FLAG_EORC: end of routine sequence conversion flag(only for GD32F5HCxx devices)
      \arg        ADC_FLAG_EOIC: end of inserted sequence conversion flag
      \arg        ADC_FLAG_STIC: start flag of inserted sequence
      \arg        ADC_FLAG_STRC: start flag of routine sequence
      \arg        ADC_FLAG_ROVF: routine data register overflow flag
      \arg        ADC_FLAG_IOVF: inserted data register overflow flag(only for GD32F5HCxx devices)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;
    if(0U != (ADC_STAT & flag)){
        reval = SET;
    }
    return reval;
}

/*!
    \brief      clear the ADC flag (API_ID(0x0022U))
    \param[in]  flag: the ADC flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_WD0E: analog watchdog 0 event flag
      \arg        ADC_FLAG_EOC: end of sequence conversion flag(only for GD32W515xx devices)
      \arg        ADC_FLAG_EORC: end of routine sequence conversion flag(only for GD32F5HCxx devices)
      \arg        ADC_FLAG_EOIC: end of inserted sequence conversion flag
      \arg        ADC_FLAG_STIC: start flag of inserted sequence
      \arg        ADC_FLAG_STRC: start flag of routine sequence
      \arg        ADC_FLAG_ROVF: routine data register overflow flag
      \arg        ADC_FLAG_IOVF: inserted data register overflow flag(only for GD32F5HCxx devices)
    \param[out] none
    \retval     none
*/
void adc_flag_clear(uint32_t flag)
{
    ADC_STAT &= ~((uint32_t)flag & ADC_FLAG_MASK);
}

/*!
    \brief      enable ADC interrupt (API_ID(0x0023U))
    \param[in]  interrupt: the ADC interrupt
                one or more parameters can be selected which is shown as below:
      \arg        ADC_INT_WD0E: analog watchdog interrupt 
      \arg        ADC_INT_EOC: end of routine sequence conversion interrupt(only for GD32W515xx devices) 
      \arg        ADC_INT_EORC: end of routine sequence conversion interrupt(only for GD32F5HCxx devices) 
      \arg        ADC_INT_EOIC: end of inserted sequence conversion interrupt 
      \arg        ADC_INT_ROVF: routine data register overflow interrupt 
      \arg        ADC_INT_IOVF: inserted data register overflow interrupt(only for GD32F5HCxx devices)
    \param[out] none
    \retval     none
*/
void adc_interrupt_enable(uint32_t interrupt)
{
     ADC_CTL0 |= (uint32_t) interrupt & ADC_INT_MASK;
}

/*!
    \brief      disable ADC interrupt (API_ID(0x0024U))
    \param[in]  interrupt: the ADC interrupt
                one or more parameters can be selected which is shown as below:
      \arg        ADC_INT_WD0E: analog watchdog interrupt 
      \arg        ADC_INT_EOC: end of routine sequence conversion interrupt(only for GD32W515xx devices)
      \arg        ADC_INT_EORC: end of routine sequence conversion interrupt(only for GD32F5HCxx devices)
      \arg        ADC_INT_EOIC: end of inserted sequence conversion interrupt 
      \arg        ADC_INT_ROVF: routine data register overflow interrupt 
      \arg        ADC_INT_IOVF: inserted data register overflow interrupt(only for GD32F5HCxx devices)
    \param[out] none
    \retval     none
*/
void adc_interrupt_disable(uint32_t interrupt)
{
    ADC_CTL0 &= ~((uint32_t)interrupt & ADC_INT_MASK);  
}

/*!
    \brief      get ADC interrupt flag (API_ID(0x0025U))
    \param[in]  int_flag: the ADC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WD0E: analog watchdog interrupt flag
      \arg        ADC_INT_FLAG_EOC: end of routine sequence conversion interrupt flag (only for GD32W515xx devices)
      \arg        ADC_INT_FLAG_EORC: end of routine sequence conversion interrupt flag (only for GD32F5HCxx devices)
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_ROVF: routine data register overflow interrupt flag
      \arg        ADC_INT_FLAG_IOVF: inserted data register overflow interrupt flag (only for GD32F5HCxx devices)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_interrupt_flag_get(uint32_t int_flag)
{
    FlagStatus interrupt_flag = RESET;
    uint32_t state;
    /* check the interrupt bits */
    switch(int_flag){
    case ADC_INT_FLAG_WD0E:
        state = ADC_STAT & ADC_STAT_WD0E;
        if((0U != (ADC_CTL0 & ADC_CTL0_WD0EIE)) && (0U != state)){
          interrupt_flag = SET;
        }
        break;
#if defined(GD32F5HC)
    case ADC_INT_FLAG_EORC:
        state = ADC_STAT & ADC_STAT_EORC;
        if((0U != (ADC_CTL0 & ADC_CTL0_EORCIE)) && (0U != state)){
            interrupt_flag = SET;
          }
        break;
#else
    case ADC_INT_FLAG_EOC:
        state = ADC_STAT & ADC_STAT_EOC;
        if((0U != (ADC_CTL0 & ADC_CTL0_EOCIE)) && (0U != state)){
            interrupt_flag = SET;
          }
        break;
#endif /* defined(GD32F5HC) */
    case ADC_INT_FLAG_EOIC:
        state = ADC_STAT & ADC_STAT_EOIC;
        if((0U != (ADC_CTL0 & ADC_CTL0_EOICIE)) && (0U != state)){
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_ROVF:
        state = ADC_STAT & ADC_STAT_ROVF;
        if((0U != (ADC_CTL0 & ADC_CTL0_ROVFIE)) && (0U != state)){
            interrupt_flag = SET;
        }
        break;
#if defined(GD32F5HC)
    case ADC_INT_FLAG_IOVF:
        state = ADC_STAT & ADC_STAT_IOVF;
        if((0U != (ADC_CTL0 & ADC_CTL0_IOVFIE)) && (0U != state)){
            interrupt_flag = SET;
        }
        break;
#endif /* defined(GD32F5HC) */
    default:
        break;
    }
    return interrupt_flag;
}

/*!
    \brief      clear ADC interrupt flag (API_ID(0x0026U))
    \param[in]  int_flag: the ADC interrupt flag
                one or more parameters can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WD0E: analog watchdog interrupt flag
      \arg        ADC_INT_FLAG_EOC: end of routine sequence conversion interrupt flag (only for GD32W515xx devices)
      \arg        ADC_INT_FLAG_EORC: end of routine sequence conversion interrupt flag (only for GD32F5HCxx devices)
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_ROVF: routine data register overflow interrupt flag
      \arg        ADC_INT_FLAG_IOVF: inserted data register overflow interrupt flag (only for GD32F5HCxx devices)
    \param[out] none
    \retval     none
*/
void adc_interrupt_flag_clear(uint32_t int_flag)
{
    ADC_STAT &= ~((uint32_t)int_flag & ADC_INT_FLAG_MASK);
}


